
&НаКлиенте
Процедура УдалитьЭлементы(Команда)
	
	Описание = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);              
	ПоказатьВопрос(Описание, "Удалить элементы выбранного справочника?", РежимДиалогаВопрос.ДаНет,0);
 
	
КонецПроцедуры
 

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 
	
	Если Результат = РежимДиалогаВопрос.ДаНет Тогда
		Возврат;
	Иначе                              
	 	ПроизвестиУдалениеЭлементов();
	КонецЕсли;
	
		
КонецПроцедуры  

&НаСервере
Процедура ПроизвестиУдалениеЭлементов()
	
	НаименованиеСправочника = ПолеВыбораСправочника;
	
	Выборка = Справочники[НаименованиеСправочника].Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
	  ЭлемСсылка = Выборка.Ссылка;
	  ЭлемОбъект = ЭлемСсылка.ПолучитьОбъект();
	  ЭлемОбъект.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	      		
	Для Каждого Спр Из Метаданные.Справочники Цикл 
		
		  Элементы.ПолеВыбораСправочника.СписокВыбора.Добавить(Спр.Имя);
			
	КонецЦикла; 
	  

КонецПроцедуры

 
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
  Элементы.ПолеВыбораСправочника = ВыбранноеЗначение;
	
КонецПроцедуры
