Функция СведенияОВнешнейОбработке() Экспорт
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Идентификатор");
	ТЗ.Колонки.Добавить("Представление");
	ТЗ.Колонки.Добавить("Использование");
	
	ТЗРег = ТЗ.Добавить();
	ТЗРег.Идентификатор = "ОткрытьФорму";
	ТзРег.Представление = "Открыть форму";
	ТЗРег.Использование = "ОткрытиеФормы";
	
	ДанныеДляРегистрации = Новый Структура;
	ДанныеДляРегистрации.Вставить("Наименование", "УдалениеЭлементовСправочника");
	ДанныеДляРегистрации.Вставить("Информация", "Обработка для массового удаления элементов выбранного справочника");
	ДанныеДляРегистрации.Вставить("Вид", "ДополнительнаяОбработка");
	ДанныеДляРегистрации.Вставить("Версия", "1.0");
	ДанныеДляРегистрации.Вставить("БезопасныйРежим", Истина);
	ДанныеДляРегистрации.Вставить("Команды", ТЗ);
	
	Возврат ДанныеДляРегистрации;
   	
	
КонецФункции
